[
  {
    "number": 1,
    "title": "So'z miqdorini belgilang va hajmni nazorat qiling",
    "description": "Aniq so'z soni belgilash javoblar hajmini boshqaradi. Model ko'rsatilgan miqdorga qat'iy rioya qilishga intiladi. Qisqa javoblar uchun kam, chuqur tahlil uchun ko'proq so'z talab qiling. Muhim narsalarni o'sha \\",
    "bad_example": "Sedana haqida menga ko'proq ma'lumot ber.",
    "good_example": "Sedana haqida 350 ta so'z qatnashgan maqola tayyorlab ber.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 2,
    "title": "Raqamlangan ro'yxat talab qiling. Oson bo'ladi",
    "description": "Raqamlangan ro'yxatlar ma'lumotni oson o'qish va eslab qolish imkonini beradi. Sub (qo'shimcha kichik) bandlar qo'shish strukturani yanada mustahkamlaydi. Murakkab tushunchalarni aniq qadamlarga ajratadi. O'quvchiga har bir nuqtani ketma-ket o'rganish imkonini beradi.",
    "bad_example": "Marketing strategiyasini tushuntir",
    "good_example": "Marketing strategiyasini 7 ta alohida band shaklida taqdim et, har bir band a, b, c kabi kichik bandlarga bo'linsin.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 3,
    "title": "Noaniq iboralarni taqiqlang. Kerak emas!",
    "description": "Noaniq iboralar javoblarni sust va ishonchsiz qiladi. Ularni taqiqlash modelni aniq pozitsiya egallashiga majbur qiladi. Natijada keskin, aniq va foydalanish uchun qulay ma'lumot olasiz. Munozarali mavzularda ham aniq fikr bildiriladi.",
    "bad_example": "Bu masala bo'yicha fikringni bilsam bo'ladimi?",
    "good_example": "Bu masala bo'yicha fikringni 200 ta so'z bilan xulosala, \\",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 4,
    "title": "Mutaxassislik darajasini belgilang!",
    "description": "Fikr murakkabligi auditoriyaga mos bo'lishi zarur. Daraja ko'rsatilsa, model termin va misollarni shunga moslaydi. Haddan ortiq ilmiy tildan qochish yoki aksincha chuqurroq kirish shu yerda hal qilinadi. O'quvchi o'z saviyasida tushunadi, vaqtini tejaydi.",
    "bad_example": "\\",
    "good_example": "\\",
    "category_id": 1,
    "notes": null
  },
  {
    "number": 5,
    "title": "Vaqt chegarasini o'rnating!",
    "description": "Vaqt chegarasi modelga tezkor, lo'nda va eng muhim faktlarga asoslangan javobni berishga undaydi. Ortiqcha batafsil ma'lumotlar qisqaradi. Eng asosiy nuqtalar aniq va tez yetkaziladi. Vaqt chegarasi qo'yilganda, model \\",
    "bad_example": "Suv filtrlari qanday ishlaydi? Iltimos, aytib yuboring.",
    "good_example": "Suv filtrlari qanday ishlaydi? Huddi 30 sekund vaqting bordek javob ber.",
    "category_id": 1,
    "notes": null
  },
  {
    "number": 6,
    "title": "Dalil turlarini talab qiling!",
    "description": "Aniq dalil turlari ko'rsatilganda, model shunchaki fikr emas, asoslangan ma'lumot beradi. Ilmiy maqolalar, statistika, ekspert fikrlari – bular javobga ishonchni oshiradi. Har bir fikr ortida mustahkam asos paydo bo'ladi. Sifatsiz ma'lumotlar chiqarib tashlanadi.",
    "bad_example": "Dalillar keltiring.",
    "good_example": "Har bir fikrni bitta tekshirilgan ilmiy tadqiqot va bitta real hayotiy misol bilan asosla.",
    "category_id": 5,
    "notes": null
  },
  {
    "number": 7,
    "title": "Paragraf uzunligini nazorat qiling",
    "description": "Qisqa paragraflar o'qishni osonlashtiradi, diqqatni jamlab turadi. Uzun matnlar o'quvchini charchatadi. Qisqa paragraflar ma'lumotni saralashga majbur qiladi, faqat eng muhimi qoladi. Material oson hazm bo'ladi, esda qoladi.",
    "bad_example": ".... Bu haqda essay yozing.",
    "good_example": "... Har bir paragrafda maksimum 4 ta gap ishlat.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 8,
    "title": "Temperatura nazoratini qo'llash",
    "description": "Temperatura – modelning ijodkorlik darajasi. Past temperatura – faktlarga asoslangan, ishonchli, konservativ javoblar. Yuqori temperatura – kreativ, kutilmagan, noodatiy g'oyalar. Vazifaga qarab tanlang. Ilmiy masalalarda pastroq, ijodiy yozishlarda yuqoriroq temperatura samarali.",
    "bad_example": "... Iltimos, eng yaxshi g'oyani bering.",
    "good_example": "...\\",
    "category_id": 2,
    "notes": null
  },
  {
    "number": 9,
    "title": "Har tomondan tahlil qiling",
    "description": "Bir masalani turli nuqtai nazardan ko'rish to'liq tushunish imkonini beradi. Har xil soha vakillari (iqtisodchi, muhandis, sotuvchi) qarashlarida katta farq bo'ladi. Masalani turli tomondan ko'rib, yashirin jihatlarni ochish mumkin. Qarorlar chuqurroq asoslanadi. (14-protokol bilan ham solishtiring.)",
    "bad_example": "Bu masala haqida fikringizni ayting.",
    "good_example": "Masalani avval texnologik tomonlarini keyin iqtsodiy tomonlarini tahlil qil.",
    "category_id": 5,
    "notes": null
  },
  {
    "number": 10,
    "title": "Ba'zi mavzularni taqiqlang",
    "description": "Ba'zan javobda ayrim mavzular keraksiz yoki ortiqcha bo'ladi. Masalan, texnik yechim izlayotganda, etik masalalar to'siq bo'lishi mumkin. Aniq maqsadga yo'naltirilgan javoblar olish uchun keraksiz yo'nalishlarni taqiqlang. Diqqatni muhim jihatlarga qaratadi.",
    "bad_example": "To'liq javob bering.",
    "good_example": "Masalaga ekologik, iqtsodiy tomondan yondash, texnik tomonlarini chetlab o't.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 11,
    "title": "Aniq manbaalar formati talab qiling",
    "description": "Aniq manbalar formati ma'lumotni tekshirishni osonlashtiradi. Standart format (masalan, APA, MLA) qo'llash barcha manbalarni bir xil ko'rinishda saqlaydi. To'g'ridan-to'g'ri URL manzillar tekshirishni tezlashtiradi. Ishonchli ma'lumotlarni ajratib olish imkoni paydo bo'ladi.",
    "bad_example": "Manbalarni ko'rsating.",
    "good_example": "Manbalarni APA formatida to'g'ridan-to'g'ri URL manzillar bilan keltir.",
    "category_id": 5,
    "notes": null
  },
  {
    "number": 12,
    "title": "Axborotni qayta ishlash uchun maxsus chegara belgisi qo'llang!",
    "description": "Belgilar yordamida muhim bloklarni tez ajratib olasiz. Keyinchalik texnik ishlar uchun ham (skript yoki regex bilan yirik matndan xulosani sug'urib olish) oson bo'ladi. Model belgilarni aniq joyga qo'yadi, tartib buzilmaydi. Tozalash va qayta ishlash jarayoni tezlashadi. Ko'z oson o'qiydi.",
    "bad_example": "Muhim fikrlarni ajrating.",
    "good_example": "Barcha asosiy xulosalarni §§ belgilari orasiga joylashtir.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 13,
    "title": "Qarama-qarshi tahlil talab qiling",
    "description": "Fikrga qarshi bo'lgan eng kuchli argumentlarni ko'rish fikrni mustahkamlaydi yoki zaif tomonlarni ochadi. Bir tomonlama qarashdan qochish imkonini beradi. Qarorlar yanada puxta bo'ladi. Muammoli jihatlar avvalroq ma'lum bo'ladi, ularga yechim topiladi. (Solishtiring: Protokol-31)",
    "bad_example": "... buning yaxshi tomonlarini aytib bering.",
    "good_example": "... Standart javobni bergandan so'ng, eng kuchli qarshi argumentni keltir.",
    "category_id": 5,
    "notes": null
  },
  {
    "number": 14,
    "title": "Turli kasblarni birlashtiring!",
    "description": "Turli soha vakillari bir muammoni ko'rishda o'ziga xos nuqtai nazarga ega. Ularni birlashtirish super yechimlar beradi. Masalan, \\",
    "bad_example": "Bu masalani tahlil qiling.",
    "good_example": "Bu masalani harbiy strateg hamda xulq-atvor iqtisodchisi nuqtai nazaridan tahlil qil.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 15,
    "title": "Ishonch chegarasini o'rnating!",
    "description": "Fakt va taxmin orasidagi farqni belgilash muhim. Ishonch chegarasi o'rnatilganda, model faqat ishonchli ma'lumotlarni beradi. Ishonchsiz faktlar chiqarib tashlanadi. Qarorlar aniq ma'lumotlarga asoslanadi. Taxminlar haqiqat sifatida taqdim etilmaydi.",
    "bad_example": "Bu haqda bilganingizni ayting.",
    "good_example": "Faqat 90%+ ishonchli bo'lgan faktlarga asoslangan ma'lumotlardan foydalan.",
    "category_id": 5,
    "notes": null
  },
  {
    "number": 16,
    "title": "Javob shablonini belgilang",
    "description": "Oldindan belgilangan format javobni tuzilishli va tushunarli qiladi. Har doim bir xil tartibda ma'lumot olish ish jarayonini yaxshilaydi. Kerakli ma'lumotlarni tezroq topish imkonini beradi. Tuzilish izchil bo'ladi, biror muhim qism tushib qolmaydi.",
    "bad_example": "Barcha ma'lumotni tartibli bering.",
    "good_example": "Quyidagi formatda javob ber: Muammo | Yechim | Amalga oshirish qadamlari | Kutilayotgan natija.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 17,
    "title": "\\",
    "description": "Agar ma'lumot yetarli bo'lmasa, model taxmin qilish o'rniga to'xtaydi. Noto'g'ri ma'lumot tarqalmaydi. Xato xulosalar oldi olinadi. O'quvchi aniqlik kiritish kerakligini biladi. Ishonch buzilmaydi. Sifatsiz javoblar o'rniga aniq signal beriladi.",
    "bad_example": "Shoptoliqoqi-PRO dorisi haqida yozing.",
    "good_example": "Agar Shoptoliqoqi-PRO haqida faktlar yetarli bo'lmasa, faqat 'Ma'lumot yetarli emas' deb yoz, taxmin qilma.",
    "category_id": 5,
    "notes": null
  },
  {
    "number": 18,
    "title": "Qisqartirish buyrug'ini qo'llang",
    "description": "Ko'p hollarda dastlabki javob keragidan uzun bo'ladi. Qisqartirish buyrug'i eng muhim ma'lumotni saqlab, ortiqchasini olib tashlaydi. Vaqt tejaladi, asosiy g'oya yorqinroq namoyon bo'ladi. Uzun ma'lumotlarni qisqa, ammo mazmunli shaklga keltiradi.",
    "bad_example": "Qisqa javob bering.",
    "good_example": "To'liq javob yozgandan so'ng, barcha muhim ma'lumotlarni saqlab, uni 50% qisqartir.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 19,
    "title": "\\",
    "description": "Har qanday qaror turli oqibatlarga olib kelishi mumkin. Eng yaxshi, kutilgan va eng yomon holatlarni ko'rib chiqish to'liq tayyorgarlikni ta'minlaydi. Har bir senariy uchun yechimlar oldindan tayyorlanadi. Xavflar kamayadi, imkoniyatlar ko'payadi. Solishtiring: Protokol-29",
    "bad_example": "Bu qarorning natijasi qanday bo'ladi?",
    "good_example": "Uchta potentsial natijani taqdim et: eng yaxshi holat, kutilgan holat, eng yomon holat.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 20,
    "title": "O'zini o'zi tekshirishni buyuring!",
    "description": "Har qanday javobda zaif tomonlar bo'ladi. Modeldan o'z javobining eng zaif qismlarini ko'rsatishni so'rash sifatni yaxshilaydi. Keyingi qarorlarda bu kamchiliklarni hisobga olish mumkin. O'z-o'zini tanqid qilish ikkita ko'z o'rniga to'rtta ko'z bilan tekshirishga o'xshaydi.",
    "bad_example": "Javobingizni tekshiring.",
    "good_example": "Javob bergandan so'ng, javobingni eng zaif uchta qismini aniqla.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 21,
    "title": "Bahola, bahola, bahola!",
    "description": "Raqamli baholash subyektiv fikrlarni obyektivlashtiradi. 1-10 shkala orqali farqlarni aniq ko'rsatish mumkin. Turli variantlarni tezda solishtirish imkonini beradi. Raqamlar asosida qaror qabul qilish osonlashadi. Hissiyotlar emas, aniq mezonlar asosida baholanadi.",
    "bad_example": "Qaysi variant yaxshiroq?",
    "good_example": "Har bir variantni samaradorlik, narx va tezlik bo'yicha 1-10 shkalada bahola.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 22,
    "title": "Til cheklovlarini qo'llash",
    "description": "Til chegaralari modelni sodda va tushunarli tilda yozishga majbur qiladi. Uzun, murakkab so'zlar o'rniga qisqa, aniq so'zlar ishlatiladi. Keng auditoriya uchun tushunarli bo'ladi. G'oyalar oddiy shaklda, ammo chuqur mazmunda taqdim etiladi. Solishtiring: Protokol-43",
    "bad_example": "Sodda tilda yozing.",
    "good_example": "Faqat 8ta harfdan kam bo'lgan so'zlardan foydalanib javob ber. Jargon so'zlar ishlatma.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 23,
    "title": "Bo'lim sarlavhalarini talab qiling",
    "description": "Sarlavhalar uzun matnni tarkibiy qismlarga ajratadi. O'quvchi kerakli ma'lumotni tezda topadi. Matn tuzilishi aniq ko'rinadi. Har bir bo'lim o'z mavzusiga ega bo'ladi. Murakkab mavzular oson hazm qilinadigan qismlarga bo'linadi.",
    "bad_example": "Batafsil ma'lumot bering.",
    "good_example": "Har 2 ta paragrafdan oldin uning mazmunini ifodalovchi qalin sarlavha qo'y",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 24,
    "title": "\\",
    "description": "Ba'zan \\",
    "bad_example": "Bu variantlar haqida fikringiz?",
    "good_example": "Har bir variant uchun 'Tavsiya etiladi' yoki 'Tavsiya etilmaydi' deb, hech qanday qo'shimcha izohsiz tanlov qil.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 25,
    "title": "Manbaa chegaralarini o'rnatish",
    "description": "Statistik da'volar manbasiz ishonchsiz bo'ladi. Har bir raqam va statistika uchun aniq manba talab qilish ma'lumot sifatini oshiradi. Tekshirib bo'lmaydigan raqamlar chiqarib tashlanadi. Ishonchli ma'lumot asosida qaror qabul qilinadi.",
    "bad_example": "Statistik ma'lumotlar keltiring.",
    "good_example": "Har bir statistik da'vo uchun aniq ma'lumot manbasi ko'rsatilishi shart.",
    "category_id": 5,
    "notes": null
  },
  {
    "number": 26,
    "title": "Jadval yaratishni buyuring",
    "description": "Jadvallar ma'lumotni tizimli ko'rsatish imkonini beradi. Solishtirish oson, farqlar aniq ko'rinadi. Katta hajmli ma'lumotni tushunish osonlashadi. Har bir o'lcham bir xil formatda taqdim etiladi. Jadval strukturasi izchil bo'lganda, ma'lumot o'qish yengillashadi.",
    "bad_example": "... Barcha solishtirishlarni ko'rsating.",
    "good_example": "... Barcha solishtirishlarni aynan uch ustunli jadval formatida taqdim et. iPhone 14 | Samsung S22 | iPhone 15",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 27,
    "title": "\\",
    "description": "\\",
    "bad_example": "Bu mahsulotni tavsiflang.",
    "good_example": "Javobingda 'ajoyib', 'zo'r' yoki 'yaxshi' so'zlarini ishlatma.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 28,
    "title": "Feynman texnikasini qo'llash",
    "description": "Eng murakkab tushunchani ham oddiy tilda tushuntirish mumkin. 10 yoshli bola tushunishi kerak bo'lsa, model oddiy so'zlar va aniq misollar ishlatadi. Ilmiy atamalar o'rniga kundalik tushunchalar keladi. Material har qanday auditoriya uchun tushunarli bo'ladi.",
    "bad_example": "Kvant fizikasini tushuntiring.",
    "good_example": "Kvant fizikasini 10 yoshli bolaga o'rgatayotgandek, faqat eng oddiy 1000 ta o'zbek so'zini ishlatib tushuntir.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 29,
    "title": "Rejalarni \\",
    "description": "Har qanday rejada zaif nuqtalar bor. Rejani boshlashdan avval uning muvaffaqiyatsizlikka uchrashi mumkin bo'lgan yo'llarini ko'rib chiqish muammolarni oldindan hal qilish imkonini beradi. Xavflar kamayadi, tayyorgarlik ortadi. Kutilmagan vaziyatlar kutilgan bo'lib qoladi. Solishtiring: Protokol-19",
    "bad_example": "Bu rejaning kamchiliklarini ayting.",
    "good_example": "Bu reja muvaffaqiyatsizlikka uchraydigan eng ehtimoliy uchta yo'lni ro'yxat qilib boshla.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 30,
    "title": "Javoblardan darrov qoniqmang",
    "description": "Javoblardan qoniqmang. Har qanday javobdan keyin \\",
    "bad_example": "Javobingni yaxshila.",
    "good_example": "Bu javobni qanday 3 ta yo'l orqali yaxshilasa bo'ladi? Javob ber. Keyin shu 3 ta yo'l asosida yangi javob taqdim qil.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 31,
    "title": "\\",
    "description": "O'z nuqtai nazaringizga qarshi argumentlarni ko'rib chiqish fikrni kuchaytiradi. Avval qarshi fikrni keltirish, keyin unga javob berish muvozanatli tahlil yaratadi. Zaif nuqtalar aniqlanadi va mustahkamlanadi. O'z fikringizga tanqidiy ko'z bilan qarash imkoni paydo bo'ladi. (Solishtiring: Protokol-13)",
    "bad_example": "Fikrimni quvvatlang.",
    "good_example": "Avval mening pozitsiyamga qarshi argumentlarni keltir, keyin ularni nuqta-ba-nuqta inkor qil.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 32,
    "title": "\\",
    "description": "Qisqa xulosa eng muhim nuqtalarni tezda tushunish imkonini beradi. 30 so'zli xulosa (executive summary) uzoq tushuntirishlardan avval kelsa, diqqat muhim jihatlarga qaratiladi. Tafsilotlarni o'qishdan oldin umumiy manzarani ko'rish mumkin. Vaqt tejaladi, asosiy g'oya aniq yetkaziladi.",
    "bad_example": "Qisqa xulosa qo'shing.",
    "good_example": "Har qanday batafsil tushuntirishdan oldin 30 so'zli \\",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 33,
    "title": "Foyda-xarajat nisbatini talab qiling",
    "description": "Har bir foyda ma'lum xarajat evaziga keladi. Ularni aniq raqamlar bilan ifodalash qaror qabul qiluvchilar uchun qimmatli ma'lumot beradi. Abstrak foydalar emas, o'lchanadigan ko'rsatkichlar taqdim etiladi. Har bir qaror oqibatlarini aniq ko'rish mumkin bo'ladi.",
    "bad_example": "Ushbu sarmoyaning foyda va zararlarini ko'rsating.",
    "good_example": "Ushbu sarmoyaning foyda va zararlarini raqamlar bilan ifodalang (masalan, har 1 so'mli investitsiya = 4 so'mlik foyda 3 yil ichida).",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 34,
    "title": "Mezonlarni saralashni talab qiling",
    "description": "Har bir qaror ko'p mezonlarga asoslanadi, lekin ularning barchasi bir xil muhim emas. Muhimlik darajasiga ko'ra saralash qaror qabul qilishni aniqlashtiradi. Eng muhim mezonlarga ko'proq e'tibor qaratiladi. Qaror qabul qilish jarayoni izchil bo'ladi.",
    "bad_example": "Qaror qabul qilish mezonlarini ko'rsating.",
    "good_example": "Tavsiyalar berishdan avval qaror mezonlarini \\",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 35,
    "title": "Rol almashtirishni qo'llang",
    "description": "Raqib nuqtai nazaridan qaror yashirin zaifliklarni ochadi. \\",
    "bad_example": "Bu strategiyaning kuchli tomonlari nimada?",
    "good_example": "Raqibingiz bu strategiyaga qanday javob berishini tushuntiring.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 36,
    "title": "Aniq misollarni talab qilish",
    "description": "Abstrakt tushunchalar misollar orqali aniq bo'ladi. Har bir nazariy fikr ortida real hayotiy misol bo'lsa, tushunish osonlashadi. Misollar nazariyani amaliyot bilan bog'laydi. Murakkab g'oyalar soddalashadi, qo'llanish usullari aniq ko'rinadi.",
    "bad_example": "Kontseptsiyani tushuntiring.",
    "good_example": "Har bir abstrakt tushunchadan keyin aniq real hayotiy misol keltiring.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 37,
    "title": "Super-Kreativlikni \\",
    "description": "Ikkita birbiriga bog'liq bo'lmagan va kesishmagan sohalarni bir biriga \\",
    "bad_example": "Suvga insonlarni munosabati qanday bo'lishi kerak?",
    "good_example": "Oddiy o'simlik urug'i sifatida suvga nisbatan o'z munosabatingni g'amgin ifodala.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 38,
    "title": "Taxminlarni ochishni talab qiling",
    "description": "Har bir javob zamirida taxminlar yotadi. Ularni ochiq ko'rsatish yashirin noto'g'ri tushunchalarni aniqlash imkonini beradi. Taxminlar aniq ko'ringanda, ularni to'g'rilash mumkin. Yashirin taxminlar xato qarorlarga olib kelishi mumkin.",
    "bad_example": "Javob bering.",
    "good_example": "Nima uchun o'rta osiyo rus mustamlakasiga aylandi? Javob berishdan oldin, javobing asosidagi barcha taxminlarni ro'yxatlab chiq.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 39,
    "title": "Turli vaqt jadvallari talab qiling",
    "description": "Muammoning yechimi qisqa, o'rta va uzoq muddatli istiqbolda farq qiladi. Har uchala variantni ko'rib chiqish to'liq tasvir beradi. Vaqtga bog'liq muammolarni aniqlash mumkin. Faqat bir vaqt nuqtasiga qaramaslik yaxshiroq qarorlar qabul qilishga yordam beradi.",
    "bad_example": "Bu muammoni hal qilish yo'lini ko'rsating.",
    "good_example": "[Muammo] Yechimni darhol amalga oshirish, 6 oylik va 5 yillik istiqbol uchun alohida-alohida taqdim et.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 40,
    "title": "\\",
    "description": "Qarshi tomonnning eng kuchli argumentlarini taqdim etish va ularga javob berish fikrni mustahkamlaydi. Kuchsiz dalillarga emas, eng kuchli qarshi argumentlarga javob berish fikrni chambarchas qiladi. Intellektual halollik oshadi. Bahsda ustunlik ta'minlanadi.",
    "bad_example": "Argumentlarimni himoya qiling.",
    "good_example": "[Bizning korxona <Davlat Nomi> bilan iqtsodiy hamkorlikni kamaytirishi kerak.] Qarshi tomonning eng kuchli argumentini taqdim etib, keyin uni inkor qil. Har ikkala tomondagi mavjud mantiqiy xatolarni top, agar bo'lsa.",
    "category_id": 3,
    "notes": null
  },
  {
    "number": 41,
    "title": "Fe'ldan boshlanadigan gaplarni qo'llang",
    "description": "Fe'llar bilan boshlangan gaplar energiya va aniqlik baxsh etadi. Majhul nisbatdan farqli o'laroq, siz kimdan nima talab qilinayotganini aniq bilasiz. Harakat so'zlari matnni jonlantiradi, o'quvchida harakat istagini uyg'otadi. Uzun kirish so'zlar o'rniga to'g'ridan-to'g'ri asosiy nuqtaga o'tiladi.",
    "bad_example": "Qanday yozish kerak?",
    "good_example": "Yaxshi yozish uchun nima qilish kerak? Gaplarning kamida 50% ini fe'l bilan boshla.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 42,
    "title": "Statistik faktlar zichligini ayting",
    "description": "Statistik ma'lumotlar tavsiyalarni ishonchli qiladi. Har paragrafda kamida bitta statistika faktlar bilan qo'llab-quvvatlashni talab qiladi. Natijada sifatli, asoslangan tavsiyalar paydo bo'ladi. Taxmin emas, aniq raqamlarga asoslangan xulosalar shakllanadi.",
    "bad_example": "Ma'lumotlar asosida yozing.",
    "good_example": "Har bir paragrafda kamida bitta tegishli statistikani kirit.",
    "category_id": 5,
    "notes": null
  },
  {
    "number": 43,
    "title": "Heminguey protokolini qo'llang",
    "description": "Qisqa gaplar o'qish va tushunishni osonlashtiradi. 15 so'zdan oshmaydigan gaplar aniq va ta'sirli bo'ladi. Uzun, murakkab gaplar o'quvchini charchatadi. Qisqa gaplar fikrni aniq yetkazadi, e'tiborni tortadi. O'quvchi diqqati saqlanib qoladi. Solishtiring: Protokol-22",
    "bad_example": "Aniq yozing.",
    "good_example": "15 so'zdan uzun bo'lmagan gaplardan foydalan.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 44,
    "title": "Metafora yaratishga majburlang",
    "description": "Metaforalar murakkab g'oyalarni tanish tushunchalar orqali tushuntirish imkonini beradi. Harbiy, sport yoki biznes metaforalari abstrakt g'oyalarni aniq tasavvur qilishga yordam beradi. Murakkab tushunchalar oddiy, ko'z oldiga keltirishga oson shaklga aylanadi.",
    "bad_example": "Konseptsiyani tushuntiring.",
    "good_example": "Har bir murakkab tushunchani harbiy, sport yoki biznes metaforasi orqali tushuntir.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 45,
    "title": "Bog'lovchi jumlalarni taqiqlang",
    "description": "Oddiy gaplar tushunishni osonlashtiradi. Murakkab, ko'p qismli gaplar o'quvchini chalkashtirib qo'yadi. Bitta mustaqil jumla yaxshiroq tushuniladi. Fikr aniq, lo'nda va to'g'ridan-to'g'ri yetkaziladi. Tushunish uchun qayta o'qish kerak bo'lmaydi.",
    "bad_example": "Ravon yozing.",
    "good_example": "Faqat bitta mustaqil jumladan iborat oddiy gaplardan foydalan.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 46,
    "title": "Sintaktik parallelizmni qo'llash",
    "description": "Bir xil tuzilishdagi jumlalar o'qishni osonlashtiradi va ma'lumotni yodda saqlashga yordam beradi. Ro'yxat bandlari bir xil so'z turkumi bilan boshlansa, ritm hosil bo'ladi. Asosiy g'oyalar yaxshiroq anglab yetiladi. Material qat'iy tuzilgan va professional ko'rinadi.",
    "bad_example": "Ro'yxat tuzing.",
    "good_example": "Ro'yxatdagi barcha bandlar bir xil so'z turkumi bilan boshlansin.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 47,
    "title": "Resurs miqdorini ko'rsatishni buyuring",
    "description": "Har bir yechim ma'lum resurslarni (vaqt, pul, odam) talab qiladi. Ularni aniq ko'rsatish real voqelikka asoslangan qarorlar qabul qilish imkonini beradi. Mavhum g'oyalar o'rniga aniq rejalar paydo bo'ladi. Qaysi yechim eng samarali ekanligini aniq ko'rish mumkin.",
    "bad_example": "Yechimlarni tavsiya qiling.",
    "good_example": "Har bir yechim uchun qancha vaqt, pul va xodim kerakligini aniq ko'rsating.",
    "category_id": 2,
    "notes": null
  },
  {
    "number": 48,
    "title": "Bo'g'in chegaralarini o'rnatish",
    "description": "Uzun so'zlar o'qishni qiyinlashtiradi. Uch bo'g'indan ko'p bo'lgan so'zlarni cheklash oddiy, tushunarli til ishlatishga undaydi. Keng auditoriya uchun tushunarli bo'ladi. Qisqa so'zlar aniq, lo'nda va ta'sirli bo'ladi. Ilmiy atamalar o'rniga oddiy tushunchalar keladi.",
    "bad_example": "Oddiy tilda yozing.",
    "good_example": "Faqat zarur bo'lganda uch bo'g'indan ortiq so'zlarni ishlating.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 49,
    "title": "O'zlik nisbatidan foydalaning",
    "description": "O'zlik nisbati (\\",
    "bad_example": "Aniq yozing.",
    "good_example": "Faqat o'zlik nisbatida (active voice) yoz, passiv nisbatdan foydalanma.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 50,
    "title": "Sezgi elementlarini qo'llang",
    "description": "Ko'rish, eshitish, his qilish bilan bog'liq tasviflar misollarni yodda qolishini ta'minlaydi. Abstrakt tushunchalarni jonli va aniq tasvirlarga aylantiradi. O'quvchi misollarni yaxshiroq eslab qoladi. Material quruq nazariya emas, jonli tajriba shaklida taqdim etiladi.",
    "bad_example": "Misollar keltiring.",
    "good_example": "Har bir misolda kamida bitta ko'rish, eshitish yoki his qilish elementlarini kirit.",
    "category_id": 4,
    "notes": null
  },
  {
    "number": 51,
    "title": "\\",
    "description": "Har qanday muammoni eng asosiy elementlarga ajratish va taxminlarsiz yechim qurish muvaffaqiyat kaliti. Bu yondashuv muammo ildizini aniqlaydi, yuzaki yechimlardan qochadi. Chuqur tushunarli va asoslangan yechimlar paydo bo'ladi. Eskirgan yoki xato taxminlar bartaraf etiladi.",
    "bad_example": "Bu muammoni hal qiling.",
    "good_example": "Yechimlar ishlab chiqishdan oldin har bir komponentni eng fundamental elementlariga ajrat.",
    "category_id": 5,
    "notes": null
  },
  {
    "number": 52,
    "title": "Xronologik tartibni majburlang",
    "description": "Qadamlarni vaqt tartibida ko'rsatish harakatlar rejasini tuzishni osonlashtiradi. Aniq vaqt ramkalari bilan ketma-ketlik chalkashliklarni yo'q qiladi. Bosqichma-bosqich yo'l xaritasi paydo bo'ladi. Rejani amalga oshirish osonlashadi, hech narsa e'tibordan chetda qolmaydi.",
    "bad_example": "[Masala] Qadamlarni ko'rsating.",
    "good_example": "[Masala] Barcha qadamlarni aniq vaqt ramkalari bilan qat'iy xronologik tartibda taqdim et.",
    "category_id": 1,
    "notes": null
  },
  {
    "number": 53,
    "title": "Atamalarni soddalashtirishni buyuring",
    "description": "Soha atamalari tushunishni qiyinlashtiradi. Ularni oddiy til ekvivalentlari bilan almashtirish keng auditoriya uchun tushunarli qiladi. Bilimga emas, tushunishga urg'u beriladi. Material har qanday o'quvchi uchun qulayroq bo'ladi.",
    "bad_example": "Bu mavzuni tushuntiring.",
    "good_example": "Barcha soha atamalarini oddiy til ekvivalentlari bilan almashtir.",
    "category_id": 1,
    "notes": null
  },
  {
    "number": 54,
    "title": "80/20 qoidasini qo'llang",
    "description": "Pareto tamoyili bo'yicha 20% harakatlar 80% natijalarni beradi. Bu muhim 20% ni aniqlash samaradorlikni oshiradi. Vaqt va resurslar eng muhim jihatlarga yo'naltiriladi. Ikkinchi darajali masalalar e'tibordan chetda qoladi. Natijalar tezroq va kamroq kuch bilan erishiladi.",
    "bad_example": "Samarali yechim bering.",
    "good_example": "Natijalarning 80% ini beradigan harakatlarning 20% ini aniqlab, faqat shularga e'tibor qarat.",
    "category_id": 2,
    "notes": null
  },
  {
    "number": 55,
    "title": "Mental model xaritalashni qo'llang",
    "description": "Turli mental modellar bir muammoga har xil nuqtai nazardan qarash imkonini beradi. Masalan, psixologik va tizimli fikrlash modellari. Uchalasi birga qo'llanilganda, to'liq tasvir hosil bo'ladi. Yangi, kutilmagan yechimlar paydo bo'ladi.",
    "bad_example": "Har tomonlama tahlil qiling.",
    "good_example": "Javobingizni uchta turli mental model orqali shakllantir: [modellarni ko'rsating].",
    "category_id": 3,
    "notes": null
  },
  {
    "number": 56,
    "title": "Ehtimollikni % da so'rang",
    "description": "Har bir potentsial natijaga aniq foiz ehtimollik berish noaniqlikni miqdorlashga yordam beradi. \\",
    "bad_example": "Ehtimoliy natijalarni ko'rsating.",
    "good_example": "Har bir potentsial natijani ehtimolligini foizlarda baholab chiq.",
    "category_id": 6,
    "notes": null
  },
  {
    "number": 57,
    "title": "Maksimum \\",
    "description": "Yakuniy javobdan 30% so'zlarni olib tashlash ortiqcha va keraksiz narsalarni yo'q qiladi. Faqat eng muhim ma'lumot qoladi. Natijada aniq, lo'nda va ta'sirli xabar shakllanadi. Vaqt tejaladi, asosiy g'oya yorqinroq namoyon bo'ladi.",
    "bad_example": "Javobni qisqartiring.",
    "good_example": "Javobni tayyorlagandan so'ng, 100% ma'noni saqlab turib, so'zlarning 30% ini olib tashlang.",
    "category_id": 3,
    "notes": null
  }
]